//  Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
Console.WriteLine("Ввдите число N: ");

